{"meta":{"title":"玩勿丧志","subtitle":"寻找适合的应用与软件","description":"不是不努力，敌人太狡猾","author":"YiCH","url":"http://yoursite.com"},"pages":[{"title":"","date":"2017-09-02T07:14:18.000Z","updated":"2017-09-03T11:22:48.276Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"眼见他高楼起，眼见他楼塌了。 一个喜欢折腾软件的图农，每天很辛苦的画图画图画图……欢迎分享知识。 E-mail: tao.wg@outlook.com"},{"title":"tags","date":"2017-09-02T07:14:18.000Z","updated":"2017-09-02T07:19:05.967Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"tags","date":"2017-09-02T07:14:18.000Z","updated":"2017-09-02T07:19:03.647Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"ShareX自定义七牛配置","slug":"ShareX自定义七牛配置","date":"2017-09-07T17:07:12.233Z","updated":"2017-09-08T15:06:38.684Z","comments":true,"path":"2017/09/08/ShareX自定义七牛配置/","link":"","permalink":"http://yoursite.com/2017/09/08/ShareX自定义七牛配置/","excerpt":"","text":"之前的图床用的 Tinypic 和 微博相册，这两者都免费且空间充足，但免费的才是最贵的，趁现在正好从 Farbox 迁到 Github（Farbox 官方迁移到 Bitcron 后经常打不开，再者国内访问速度一直就很慢，就抛弃了），尝试一下推荐甚广的七牛云。没怎么研究七牛云有没有官方的上传工具，之前一直用 ShareX 上传截图与图片，所以搜索了一下这个，仅找到了一篇有效文章，链接如下：YSTYLE—ShareX使用七牛文件上传 这里面详细介绍了步骤，在这里增加一些基本的信息供参考： Shift+右键打开的是 Powershell，在这里输入命令。 在文章给出的 Windows 使用示例命令前加上“./” ，再复制到 Powershell，如下，注意空格： 1./qiniutoken.exe -ak=自己的AK -sk=自己的SK -bk=自己上传图片的空间名 程序会自动计算Token，然后粘贴到配置文件相应处就可以。 自己折腾的过程中就只遇到了这两个小问题，再次感谢该篇文章的作者。 如果觉得麻烦，还有一个软件可以选择：七牛图片上传工具—MPic这个就比较方便，还可以已上传进行图片管理。","categories":[],"tags":[{"name":"Soft","slug":"Soft","permalink":"http://yoursite.com/tags/Soft/"},{"name":"Img","slug":"Img","permalink":"http://yoursite.com/tags/Img/"}]},{"title":"安心写作工具简单介绍","slug":"安心写作工具","date":"2017-09-01T20:07:28.000Z","updated":"2017-09-10T16:38:01.312Z","comments":true,"path":"2017/09/02/安心写作工具/","link":"","permalink":"http://yoursite.com/2017/09/02/安心写作工具/","excerpt":"","text":"安心写作工具是在自己写作过程中发现有这个需求的，如果用通常的写作工具会感觉眼睛很累，桌面其它干扰元素较多，注意力容易被分散。这类工具的一打特点就是全屏占有，没有过多的状态栏、工具栏等元素，旨在提供干净环境写作。由于这只是很单一的功能，所以只是打算简单介绍一下，其中任何一个功能都会够用。记事本类的就不介绍了。 一、在线类1.Writer 支持Markdown写作 Google 帐号绑定 可以自定义设置颜色 自动储存 可以统计中文字数 中文PDF导出乱码，得用PDF打印机 2.ZenPen 支持Markdown格式导出 二、离线类1.Q10 该类软件鼻祖 带打字机音效（中文输入法没有） 自定义颜色 可以统计中文字数 默认设置中文显示不全，解决方式：Ctrl+P打开设置\\Layout\\Line Spacing 改为200 2.Writemonkey 带打字机音效 自定义颜色 默认设置中文输入有问题，解决方式：F10打开设置/Misc（最后一个）/Enable markup syntax highlighting 勾选去掉 3. ZenWriter 很漂亮也很贵 带音乐 带打字机音效 有 Night 模式但不能自定义颜色","categories":[{"name":"Machine Learning","slug":"Machine-Learning","permalink":"http://yoursite.com/categories/Machine-Learning/"}],"tags":[{"name":"Soft","slug":"Soft","permalink":"http://yoursite.com/tags/Soft/"},{"name":"Write","slug":"Write","permalink":"http://yoursite.com/tags/Write/"}]},{"title":"Google Earth带你了解现存社会主义国家","slug":"地图对比","date":"2016-12-06T08:00:00.000Z","updated":"2017-09-02T17:54:40.631Z","comments":true,"path":"2016/12/06/地图对比/","link":"","permalink":"http://yoursite.com/2016/12/06/地图对比/","excerpt":"","text":"##写在前面1. 本文不讨论政治，本文不讨论政治，本文不讨论政治（严肃脸）。2. 个人知识与精力有限，文中有纰漏之处望指正（笑脸） 由于古巴领导人卡斯特罗的逝世，大家再一次关注了这个孤悬海外、伴邻美国的社会主义国家。也许大家都知道世界上还存在着除了我们祖国以外的其它社会主义国家，但对他们并没有去进行更多的了解，借此契机，利用 Google Earth（谷歌地球），带领大家来稍微了解一下同在为共产主义奋斗着的国家。从地图上，我们兴许可以直观地领悟一些我们所关心问题的答案，比如说：古巴人民和朝鲜人民是不是生活在水深火热之中？ 一、社会主义国家“社会主义国家”这里指的是实行社会主义制度的国家。按照国内普遍观点，当今世界范围内社会主义国家有如下五个： ###（1）中华人民共和国（People’s Republic of China）中华人民共和国位于亚洲东部， 是工人阶级领导的人民民主专政的社会主义国家。1949年10月1日成立。国土面积960万平方公里，人口13.76亿（2015年估计数据）。 ###（2）朝鲜民主主义人民共和国（Democratic People’s Republic of Korea）朝鲜民主主义人民共和国位于东亚朝鲜半岛北部，于第二次世界大战后的1948年9月9日成立，在中国大陆一般简称朝鲜，其他地区有北韩、北朝鲜的称呼，英语则无此分歧，“朝鲜”“韩国”统称为Korea，朝鲜则是North Korea。国土面积12万平方公里，人口2,525万人（2015估数据计）。 ###（3）越南社会主义共和国（Socialist Republic of Vietnam） 越南社会主义共和国，位于东南亚的一个中南半岛东端国家，国土面积33万平方公里，拥有约9,450万人口。 1975年4月30日，在经过二战、越法战争和越南战争（内战）后，越南统一并更名越南社会主义共和国。 “越南”国名乃嘉庆皇帝钦赐：阮朝王表请清朝册封“南越国王”，嘉庆帝改以“越南国王”之名册封，阮朝正式国号即为“越南”。另附原文如下： 阮福映表请以“南越”二字锡封。上谕大学士等曰：“南越”之名，所包甚广。考之前史，今广东、广西地亦在其内。阮福映即有安南，亦不过交趾故地，何得遽称“南越”？该国先有越裳旧地，后有安南全壤。天朝褒赐国号，著用“越南”二字，以“越”字冠其上，仍其先世疆域；以‘南’字列于下，表其新赐藩封；且在百越之南，著于《时宪书》内，将“安南”改为“越南”。 ###（4）老挝人民民主共和国（Lao People’s Democratic Republic）老挝人民民主共和国，简称老挝，是中南半岛上唯一的内陆国家。邻国有西北部的缅甸、中国，东部的越南，南部的柬埔寨与西部的泰国。国土面积约23.6万平方公里，人口约707万人（2015年估计数据），首都万象。老挝历史悠久，1893年沦为法国殖民地，1945年10月12日宣布独立，1975年12月2日宣布废除君主制，成立老挝人民民主共和国。另附“老挝”名字由来： 在20世纪50年代前中国的报纸在报导老挝新闻时使用的中文名称上比较混乱，有称“寮”“佬”等等，于是陈毅元帅翻了古代的书，他把寮国改成老挝，一直沿用至今。 ###（5）古巴共和国（The Republic of Cuba）古巴共和国是美洲加勒比海北部的一个群岛国家，处在加勒比海北部，墨西哥湾入口处，西与墨西哥尤卡坦半岛隔尤卡坦海峡，领土包括古巴主岛及其附属群岛和青年岛，共11万平方公里，人口1121万（2012年估计数据）。古巴是美洲唯一的社会主义国家，面临着美国长期的经济封锁，但凭借78.3岁的预期寿命和99.9%的识字率，且不足1.8公顷的人均生态足迹，其人类发展指数多年来一直维持在高水平。古巴于1492年10月被哥伦布发现。1511年成为西班牙殖民地。1529年在古巴爆发的麻疹杀死了三分之二幸存自天花的原住民，他们对来自欧洲的传染病毫无抵抗力，在一个世纪之内几乎全部灭绝。1790年，古巴出现初期要求独立的运动；19世纪中期起，承受高赋税的古巴人开始反抗西班牙殖民统治；美西战争后西班牙割让古巴给美国，1902年美国承认古巴独立。1959年1月1日，菲德尔·卡斯特罗率领革命者推翻旧政府，成立革命政府。是年，该政府实施了包括土地改革在内的国有化改革，推广集体农业古，带领古巴走上社会主义道路。 注： 虽然朝鲜民主主义人民共和国仍宣称该国为社会主义共和国，鉴于该国已经删除了共产主义和马克思列宁主义作为党和国家的指导思想和意识形态，且朝鲜劳动党在1980年已放弃马列主义而将主体思想确立为唯一指导思想，因此在严格定义上是不属于社会主义国家范畴。—— 维基百科-社会主义国家 尼泊尔于2008年正式废除沙阿王朝君主制政体，建立联邦制的议会共和制的尼泊尔联邦民主共和国。尼泊尔由尼泊尔大会党、尼泊尔共产党（联合马列）和尼泊尔共产党（毛主义中心）轮流执政，也没有资料显示尼泊尔是生产资料公有化的社会主义性质国家，故在此不列入。—— 维基百科-尼泊尔 二、首都###（1）中国-北京市 北京市是中华人民共和国首都、直辖市和京津冀城市群的中心，中国的政治、文化、交通、科技创新和国际交往中心。经济，金融的决策与管理中心。北京市常住人口2170.5万（2015年数据），面积1.64万平方公里。北京是世界上最大的城市之一，具有重要的国际影响力，人类发展指数位居中国大陆省级行政区第一位。北京悠久的历史孕育了故宫、天坛、八达岭长城、颐和园等众多名胜古迹。公元前1045年，北京成为蓟、燕等诸侯国的都城。公元938年以来，北京先后成为辽陪都、金中都、元大都、明清国都。1949年10月1日成为中华人民共和国首都。 ###（2）朝鲜-平壤直辖市平壤直辖市是朝鲜民主主义人民共和国的首都和最大城市，位于朝鲜半岛西北部，人口32.5万（2011年数据），面积3,194 平方公里。平壤是朝鲜半岛历史最悠久的城市，多代王朝都城，在朝鲜战争中平壤几成废墟，战后又迅速重建。 （3）越南-河内市 河内市是越南的首都，古时曾称“东京”，位于越南北部，红河三角洲西北部，红河右岸和红河与墩河的汇流处，因处红河与苏沥江之间而得名“河内”。总面积 总计 3,325平方公里，人口644.9万（2009数据）。河内是越南的工业、文化中心，同时也是越南历史古都，其拥有1000多年历史，从公元11世纪起就是越南政治、经济和文化中心，市区历史文物丰富，名胜古迹遍布。 （4）老挝-万象万象始建于公元前4世纪，自公元14世纪以来，万象一直是老挝的首都和经济中心。万象人口78.3万（2013年估计数据），总面积3,920平方公里。“万象”的含义是“檀木之堡”。因此地曾经生长着许多珍贵的檀木而得名。在台湾等地区称之为“永珍”，“永”是城市的意思，“珍”是庙宇的意思，合起来为“庙宇林立的城市”。万象与泰国一衣带水，在枯水季节可徒步涉水而过，跨越国界，与邻国如此近距离的首都还是相当少见的。 （5）古巴-哈瓦那市哈瓦那市为古巴的首都，主要城市以及商业中心。城市人口有210万（2012年数据），面积728平方公里，是古巴和加勒比海国家里最大的城市。西班牙腓力二世国王于1592年授予哈瓦那城市的封号，1607年成为当时属西班牙殖民地的古巴的首都，1762年，英国在七年战争中夺取哈瓦那，而后英国和西班牙对换古巴与佛罗里达，哈瓦那又归西班牙管制。 三、 非首都大城市（1）中国-上海市 上海市，简称沪，别称申，中华人民共和国直辖市，中国大陆经济、金融、贸易中心城市，国家财政收入支柱城市。上海市最重要的产业为商贸流通、金融、信息、制造等。上海是中国的铁路与航空枢纽，其港口为世界最大的集装箱港。 （2）朝鲜-咸兴市 咸兴市位于咸镜南道中部海边，位于朝鲜半岛东海岸咸镜湾畔，是仅次于平壤的朝鲜第二大城市，拥有化学、纺织、机械等大规模的重工业和轻工业基地，有许多观光名胜。 （3）越南-胡志明市 胡志明市，原名“西贡”，曾是南越首都，现是越南最大的城市，也是越南的五个中央直辖市之一，为越南经济、贸易、交通及文化中心。该城市现在的名字是为了纪念越南共产主义政权建国领导人、越南劳动党主席兼越南民主共和国主席胡志明。 （4）老挝-凯山·丰威汉市 凯山·丰威汉市是现在老挝第二大城市，从前的名字是“沙湾那吉市”，意思是“天堂里的城市”。2005年为纪念老挝人民民主共和国建国领导人，先后任老挝人民革命党总书记、主席，首任政府总理及第二任国家主席的凯山·丰威汉，该市被改成今天的名字。 ###（5）古巴-圣地亚哥·德·古巴 圣地亚哥·德·古巴（Santiago de Cuba），位于古巴东南部，是圣地亚哥省的首府，也是古巴第二大城市和重要海港，面积1,023.8平方公里，人口494,337（2004年）。联合国教科文组织世界遗产——圣佩德罗德拉罗卡城堡就位于该市。 四、 历史古都###（1）中国-西安市西安市古称“长安”，历史周、秦、汉、隋、唐等13个朝代在此建都是“世界四大古都”之一[另三者是开罗(今埃及开罗)、巴比伦(今伊拉克巴格达)和君士坦丁堡(今土耳其伊斯坦布尔)]，曾经作为中国首都和政治、经济、文化中心长达1100多年。西安境内现有两项六处遗产被列入《世界遗产名录》，分别是：秦始皇陵兵马俑、大雁塔、小雁塔、唐长安城大明宫遗址、汉长安城未央宫遗址、兴教寺塔。 主要景点： 秦始皇兵马俑博物馆 大雁塔 小雁塔 大明宫遗址 秦始皇陵 华清池 ###（2）朝鲜-开城特级市开城特级市是朝鲜民主主义人民共和国黄海北道的城市。开城是高丽时代的古都，经历了五百多年的繁荣，传统商业兴盛。开城原属京畿道，南北分治之后成为了朝鲜的边境城市。近郊所产的高丽人参，驰名国际。开城特级市曾是开城工业地区的一部分，容许来自韩国及世界各地投资者开设工厂。 主要景点： 高丽博物馆 (Koryo Museum) 满月台(Manwoldae)遗迹 观音寺(Kwanum Temple)遗迹 开城南大门 (Nam Gate in Kaeson) 成均馆 (Koryo Songgyungwan) 观德亭 (Kwangdok Pavilion) （3）越南-顺化市 顺化市是越南中部承天顺化省的省会。顺化历史上曾先后为西山朝和阮朝（1802年-1945年）的京城，是越南的古都，以历史古迹著称。1993年，顺化京城和顺化皇城（顺化历史建筑群）被联合国教科文组织列为世界文化遗产。 顺化地区风景秀丽，古代越南人曾有《游顺化》云： 赴京之道十八曲，山青水绿如画里。 主要景点： 顺化皇城 顺化午门 顺化旗台 顺化天姥寺 顺化皇帝陵 顺化御屏山 ###（4）老挝-琅勃拉邦琅勃拉邦为老挝琅勃拉邦省省会，是老挝“佛都”，亦是老挝现存的最古老的一个城镇，已有千余年的历史，为世界文化遗产。1353年澜沧王国定都于此，改名川铜。1560年起，因供奉来自高棉勃拉邦佛像，改名琅勃拉邦，曾是澜沧国（孟骚）、澜沧王国（南掌）、琅勃拉邦澜沧王国国都。 主要景点： 王宫博物馆 香通寺 维苏那拉特寺 浦西山 ###（5）古巴同瓦哈那。 主要景点： 古巴国会大厦 拉富埃尔萨城堡 莫罗城堡 哈瓦那旧城 何塞·马蒂革命广场 圣塔玛丽亚海滩 五、 港口城市###（1）中国-大连市 大连市，别称滨城，位于辽宁省辽东半岛南端，地处黄渤海之滨，背依中国东北腹地，与山东半岛隔海相望，是中国东部沿海重要的经济、贸易、港口、工业、旅游城市。 （2）朝鲜-元山市元山市，1880年由侵占朝鲜半岛的日本军开港，朝鲜民主主义人民共和国江原道首府，位于东朝鲜湾的港口城市。在元山也有朝鲜人民军海军基地。 （3）越南-海防市海防市是越南北部的中央直辖市，位于海防重要河流禁江上，是越南第二大港口，可容纳13万吨轮半载停泊。1870年越南阮朝在此地建设码头，设立贸易商馆，驻海防兵力，地名起源于此。 （4）老挝东南亚唯一内陆国家，无海港。 （5）古巴-哈瓦那同瓦哈那。 六、历史宫城（博物馆）###（1）中国-故宫博物院广义故宫博物院主要分为两处——北京故宫博物院和台北故宫博物院，前者主要看建筑，后者主要看藏品，其中历史缘由自不用细说。 1）北京故宫博物院 前身是明清两代皇宫“紫禁城”。民国元年（1912年）清帝溥仪退位后仍居于宫内。至民国十三年（1924年）十一月五日，黄郛摄政内阁公布修正清室优待条件第五条，废除皇帝尊号，请废帝溥仪出宫。后经摄政内阁核准，经一年之整理，故宫博物院于民国十四年国庆节（1925年10月10日）正式成立开幕。故宫位于北京中轴线的中心，占地面积72万平方米，建筑面积约15万平方米；始建于明成祖朱棣永乐四年（1406年），永乐十八年（1420年）落成；藏品也主要是以明、清两代皇宫及其收藏为基础。北京故宫博物院是国家一级博物馆，与俄罗斯埃米塔什博物馆、美国大都会博物馆、法国卢浮宫、英国大英博物馆并称为世界五大博物馆。 2） 台北故宫博物院 建造于1962年，1965年夏落成。占地总面积约16公顷。为仿造中国传统宫殿式建筑，主体建筑共4层，白墙绿瓦，正院呈梅花形。台北故宫博物院内收藏有自南京国立中央博物院筹备处、国立北平故宫博物院和国立北平图书馆等所藏来自北京故宫、沈阳故宫、避暑山庄、颐和园、静宜园和国子监等处的皇家旧藏。所藏的商周青铜器，历代的玉器、陶瓷、古籍文献、名画碑帖等皆为稀世之珍。展馆每三个月更换一次展品。截至2014年底，馆藏文物达69.6万余件文物。 北京故宫博物院 另附:台北故宫博物院 （2）朝鲜-满月台遗址 1）满月台遗址位于朝鲜民主主义人民共和国的开城工业地区之市中心区的西北之松岳山南麓，它是高丽时代的王宫遗迹，占地约1,250,000平方公呎，现时仅存宫址及础石。 2）高丽博物馆位于朝鲜民主主义人民共和国的开城工业地区。在公元1987年建造，它设有12栋主要建筑物及6栋属于成均馆（Koryo Songgyungwan）的附属建筑物，总面积高达70,000平方米，拥有超过1,000件历史遗物，馆外亦有石塔、石碑及石灯等展品。 满月台遗址 另附：高丽博物馆 （3）越南-顺化皇城顺化皇城位于越南承天顺化省顺化市，坐落于顺化古城中央，是越南阮朝的故宫，也是越南现存规模最大的古建筑群。1993年与顺化京城一道以“顺化古迹建筑群”名义被联合国教科文组织收入世界文化遗产名录。 （4）老挝-王宫博物馆王宫博物馆始建于1904年，位于琅勃拉邦古城中央，处于普西山与湄公河之间，原本是西萨旺冯国王（King Sisavang Vong）以及此后历代国王的寝宫。1975年，老挝废除君主制，成立老挝人民民主共和国，将该王宫改为国家博物馆供人们参观，是琅勃拉邦古城最为著名的景点之一。 （5）古巴无 七、主要海岛（1）中国-海南岛海南岛位于中国最南端，岛上设海南省，全省下辖4个地级市，5个县级市，4个县，6个自治县。海南全省陆地（主要包括海南岛和西沙、中沙、南沙群岛）总面积3.54万平方公里，海域面积约200万平方公里。海南别称琼崖、琼州，公元前110年，中央政府在海南岛设置珠崖郡、儋耳郡，属交州刺史管辖，标志着海南正式纳入中国版图。1988年4月，海南从广东省划出，独立建省，海南省和海南经济特区正式成立。海南经济特区是中国最大的省级经济特区和唯一的省级经济特区。 （2）朝鲜-薪岛郡薪岛郡是朝鲜民主主义人民共和国平安北道的一个郡，由位于鸭绿江口的小岛组成，包括薪岛、绯缎岛、西湖岛、黄金坪等。现总面积108.2平方公里。三四十年代，当时薪岛还很小，绸缎岛基本未成型。 鸭绿江入海口处的绸缎岛本来在江心，按20世纪60年代的中朝划界条约规定属于朝鲜一方，但后来该岛在中国一侧的航道被泥沙淤塞，该岛与中国陆地连成一片，鸭绿江入海口就成了朝鲜的“内河”。 （3）越南-富国岛富国岛面积589.2平方公里，是越南实际控制的最大的岛屿，目前行政区划上属于越南坚江省富国岛县管辖。越南与柬埔寨就富国岛主权归属问题有纠纷。1982年，越南入侵柬埔寨之后，越南的傀儡政权柬埔寨人民共和国曾表面上与越南达成解决争端的协议，但后来并未正式签署。柬埔寨至今仍宣称对富国岛的拥有主权。 （4）老挝东南亚唯一内陆国家，无海岛。 （5）古巴- 青年岛青年岛面积2,419平方公里，岛上设立青年岛特区，首府和主要城镇是新赫罗纳。1494年，哥伦布抵达青年岛，宣布此地为西班牙领地。1898年美西战争结束后，西班牙放弃了青年岛，但是并未明确说明将其交给新独立的古巴，导致美国和古巴的争夺。1907年，美国最高法院裁决此岛并非美国领土。1925年，美国承认了古巴对该岛的主权。 八、高等学府（1）中国-武汉大学武汉大学是一所位于湖北武汉市的综合研究型大学，其办学源头溯源于清朝末期1893年湖广总督张之洞奏请清政府创办的自强学堂，已有一百多年历史，1913年改名国立武昌高等师范学校， 1926年组建国立武昌中山大学，1928年定名国立武汉大学，是民国四大名校之一。1949年新中国成立更名武汉大学沿用至今。——不知道清华北大哪个好，还是选我省最好的来代表吧（华科不要争）。 （2）朝鲜-金日成综合大学金日成综合大学，成立于1946年10月1日 ，是朝鲜第一所正规大学，金日成主席亲自为学校选址 。以“干部培养基地”、“主体教育与科学的最高学府”自居。金日成综合大学改变了朝鲜半岛北部没有大学的历史（朝鲜半岛上最早的正规大学是日本占领时期，位于今韩国首尔的京城帝国大学）。——这难道不是中央党校？ （3）越南-河内国立大学河内国立大学是一所越南的高等院校，位于首都河内。国立河内大学是越南仅有的两所国立大学的其中一间（另一所为国立胡志明大学）。该校在越南科教体系中占有特殊地位，由政府总理直接分管。——为什么没有运动场？ （4）老挝-老挝国国立大学老挝国国立大学位于首都万象，成立于1996年，也是该国唯一一所国家大学。——听说住宿条件极差。 ###（5）古巴-哈瓦那大学哈瓦那大学建成于1721年9月21日。它是古巴最古老、规模最大的一所大学，也是拉丁美洲地区历史最悠久的高等学府之一，同时也是美洲最先建成的几所大学之一。现哈瓦那大学共有十五个系和十四个研究中心，涉及包括经济、自然科学、人文科学在内的多个领域。总共有大约25个专业。现在学校大约有6000名来自世界各地的学生。 本来以为写学校这一部分最有趣的，但是写完了发现除了中国，其他四国加起来都没几所从地图上看起来比较好的大学，也不知道这些学校的范围，截图的时候只能凭自己的判断大致给个范围了。 #九、沿海养殖这一部分主要是为了给大家看海景。 （1）中国-福建福清市&amp;广东雷州半岛 （2）朝鲜-平安南道 （3）越南-海防市 （4）老挝无 （5）古巴沿海岸线找了一圈没找到…… #十、农村 （1）中国中国以仅仅相当于世界7%的耕地养活了几乎占世界五分之一的人口，足以见得我国是农业大国。途中也可以看到农村的人口密度很高，但是住宅分散，一般沿着路和河流分布。 （2）朝鲜 朝鲜是全球唯一一个还实行集体农业并以此为主的国家。朝鲜山多平地少，可耕地面积只占国土的22%，耕地大多集中在如咸镜两道和江原道等东部地区。为提高农民生产的积极性和农产量，朝鲜政府2002年推行的改善措施中推行承包制，私人农场也在此时被政府提出，农民可以拥有自己的土地，并自行决定所种的作物。朝鲜政府在2012年决定进一步改革农业：集体农场可有更大的自由度选择耕作的作物及对其的处置权。图是选的平壤直辖市附近的，感觉是地多人少，可能因为科技水平和管理水平导致产粮量低下吧。 （3）越南越南是传统农业国，农业人口约占总人口的75%。耕地及林地占总面积的60%。从地图上看，越南的农村人口密度也挺大，但是住宅密集度较大，相比中国农村分散式的分布更有城镇化的趋势。 （4）老挝老挝全国可耕地面积约800万公顷，农业用地约470万公顷，具体情况可能和中国农村差不多。 （5）古巴古巴农业以种植甘蔗和烟草（毕竟古巴雪茄远近闻名）为主。据2015年版《世界概况》，古巴国内生产总值的构成如下：农业占4%，工业占23.5%，服务业占72.7%。古巴在占国土面积约一半的可耕地上，实际种植面积约为500万公顷，，但农业人口不足全国人口的9%，所以看到“农村”（“城市农业系统”，地图里可以看到城市社区类型的住宅，难道古巴人民早已达到小康生活了……）人口密度极小。 附： 优美风景###（1）中国 西藏纳木错 新疆塔克拉玛干沙漠 湖北宜昌三峡大坝（2009） 湖北丹江口水库 云南梯田 （2）朝鲜 朝鲜黄海南道沿海 朝鲜平安南道沿海冰期 （3）越南 越南后江省人工河 越南庆和省海岸 （4）古巴 古巴哈瓦那 古巴青年岛 古巴谢戈阿维拉 -古巴关塔那摩 古巴马坦萨斯 文中资料来源： 图片来自Google Earth； 文字、数据来自维基百科与百度百科。 End.","categories":[],"tags":[{"name":"Essay","slug":"Essay","permalink":"http://yoursite.com/tags/Essay/"},{"name":"Map","slug":"Map","permalink":"http://yoursite.com/tags/Map/"}]},{"title":"青玉案","slug":"青玉案","date":"2016-11-17T03:15:00.000Z","updated":"2017-09-02T17:51:35.506Z","comments":true,"path":"2016/11/17/青玉案/","link":"","permalink":"http://yoursite.com/2016/11/17/青玉案/","excerpt":"","text":"Date: 2016-11-15 21:33 贴上几首高中时期的“诗”。这些文字在那时创建的博客里被放在“青玉案”目录下，因此为名。 1. 关不上的窗北面的窗，一直关不上，在等一个晴天。在窗前眺望，白色的长裙在雨伞下飘扬，没有雨伞的晴天，我该能看见你的脸。 在窗前等一个晴天。 2. 我们丢失了月光曾经，梦在月光中穿梭；迷茫的雾，收藏了月光，酿成了露珠的寂静之味，露珠滴落，碎裂了一颗透明的心，月光从裂痕泄露。散落的花瓣，化为信笺，月光绣了字，遥寄我的思念。萤火虫在草丛中，以月光为弦，闪烁着弹奏求偶的旋律。 现在，我们丢失了月光。城市里的灯光，弥漫了我们的双眼。月光在高楼间的缝隙消失，不知道何时月缺，何时月圆。 丢失了月光，遗失了一个古典的梦。 3. 雨的味道夏夜的雨，在黑暗中摸索着笔直落下。楼上听雨的少年，不识愁滋味，感知到了雨的味道。 那是，雨沿着青色的古瓦，在檐边晶莹地成串落下，在空中碰撞的清越之声； 那是，雨躲入田田荷叶中，惊醒沉睡的芙蓉苞蕾，在漫天的雨滴之间，散发着晨露般清雅的幽香； 那是，雨落在不曾流动的死水里，激起的涟漪层层重叠相交，不能述说的玄妙。 梦境，被雨的味道碎裂。 4. 夜牧童的牧笛被吹响，白色的羊群在草地上，咀嚼着焦黄的余晖。北方吹来的风，摇晃着尖端金黄的草，扫净天边的残霞。 笛声呜呜，羊叫咩咩，太阳用尽最后的力量，点亮了天上的街灯，星星像拉链一样将天幕拉拢。黑夜的明眸，端详着皎洁月光下的银白的羊。牧童收起牧笛，抬头凝望独挂的玉盘明月：神话中的嫦娥，在一片银辉中不见踪影，吴刚伐树的斧声，也被风吹过了树林，和宿鸟的梦呓一起飘渺。 远处山黛沉睡朦胧，纹丝不动；近处溪水闪光跳跃流逝，不舍昼夜。村里点点灯影昏黄，有的烟囱冒着淡薄青烟，被月光照散。 呼唤，从灯光青烟处传来，牧童站起身扬扬鞭，宁静的夜在吆喝声与羊叫声中，又恢复了宁静。 5. 给自己一个微笑清晨醒来，对着镜子提提嘴角，给自己一个微笑。 藤上挂着的紫色葡萄，在风吹下摆摇，昨夜的露珠，吹响风声落坠。藤下盛开的月季，露着甜蜜的笑靥，用绯红的脸庞托起这滴夜的精灵，分享它静雅的寂寞。路边的香樟树还在落叶，焦黄的叶，在追求了一生的阳光里，带着笑意飘落。翠绿的竹海，在风中呼啸，彼此之间诉说着对夏日的欢喜。掠过天空的云，丝丝缕缕飘渺，像是蓝天的笑容，遍布天际。 给自己一个微笑，身边的事物都带着笑意，自己也会觉得愉快。 6. 无聊太阳在天空燃烧，知了在绿叶中隐藏，带着热浪聒噪。花色的猫眯着眼打着哈欠，匍匐在葡萄架下瞌睡。古老的镜子，反射着强烈的阳光，墙上一块光斑在游走。斑驳的光影，在水泥地面上摇曳。 窗帘后面，我蜷缩在沙发里，电视里的人影在热闹穿梭，我心里寂静。拨开一条缝隙，看见天上明亮的云朵，我想上面肯定有一座宫殿，金碧辉煌一尘不染，那好似上面的天堂。 我想到下面的苏杭，遥远的江南，远古的铃声，划破寂静。 7. 无题（博客评论里某读者留下的，适当修改）我们盲目地站在路口 ，像是一个风向标 ，随风飘摇，却没有一固定个方向。当风静止，还停留在原点 。 从来没有选择，也不用选择 ，生活像破旧了还来不及修补的风帆，月光透过疮伤 ，零碎的洒在不平静的海面，折射不不堪的倒影，带半点忧伤婉转而幽扬，像笛声一样又附有几分沧桑。 于是，在迷茫之中，我遗忘了失散的背影。","categories":[],"tags":[{"name":"Essay","slug":"Essay","permalink":"http://yoursite.com/tags/Essay/"}]},{"title":"12款博客图床推荐与对比","slug":"12款博客图床推荐与对比","date":"2016-11-17T03:13:00.000Z","updated":"2017-09-02T17:47:24.339Z","comments":true,"path":"2016/11/17/12款博客图床推荐与对比/","link":"","permalink":"http://yoursite.com/2016/11/17/12款博客图床推荐与对比/","excerpt":"","text":"由于大部分博客平台并不支持直接上传图片，需要使用第三方存储空间（图床）来保存图片，然后在文章中插入图片的链接就可以显示图片，这样可以更方便管理不同文章中的图片。免费的图床有不少，但是稳定的屈指可数，付费图床比较稳定，一般都会提供有限的免费使用空间。下面推荐一些没有被限制访问，使用体验比较好用的图床，各位依自己使用体验来选择。每条推荐后面的图片都是该图床的示例图片，可以直观反映图床的图片质量与加载速度。 1. Photobucket 容量流量：免费容量2GB，流量10GB/月； 图片尺寸：可以设置上传尺寸（设置路径 Setting - Album - Upload Options），最大 1024x768； 保存时间：永久； 批量上传：允许； 访问速度：网站速度较慢，图片加载速度较快。 2. TinypicPhotobucket旗下网站，上传的图片都是公开的，可上传视频。 容量流量：无限； 图片尺寸：可以设置上传尺寸，最大 1024x768； 保存时间：图片三个月若无人浏览即删除； 批量上传：不允许，可通过邮件和 Url 上传图片； 访问速度：网站速度较快，图片加载速度快。 3. 微博相册新浪旗下网站。请勿商业使用。 容量流量：无限； 图片尺寸：默认缩略图与原图； 保存时间：永久； 批量上传：允许，Chrome有第三方插件可以试用； 访问速度：网站速度快，图片加载速度快。 4. 又拍网又拍云旗下网站。 容量流量：100M流量/月； 图片尺寸：提供各种尺寸不同链接，可使用原图； 保存时间：永久； 批量上传：允许，可通过邮件上传； 访问速度：网站速度快，图片加载速度快。 另外有又拍照片管家，免费100M存储空间，1GB流量，其他类似前者，两者不通用。 5. Github这是一个托管项目的网站，不建议上传大量图片。 容量流量：无限； 图片尺寸：原图； 保存时间：永久； 批量上传：允许； 访问速度：网站速度慢，图片加载速度较慢。 6. Imageshack 容量流量：免费试用30天； 图片尺寸：上传原图，可选择不同尺寸，不同的尺寸有不同的链接； 保存时间：永久； 批量上传：允许； 访问速度：网站速度较慢，图片加载速度快。 7. Someimage最大可上传25M图片，允许成人内容……提供的图片直接链接少了.jpg的后缀…… 用 Markdown 写作时要自己补上。 容量流量：无限； 图片尺寸：缩略图和原图，上传时可以选择缩略图的像素； 保存时间：永久； 批量上传：允许； 访问速度：网站速度较快，图片加载速度快。 · 8. 花瓣花瓣主要是用来采集网络图片的，从网站上采集比较方便，若自己上传图片则没其他图床好用。 容量流量：无限； 图片尺寸：默认缩略图和原图； 保存时间：永久，间接性无法加载； 批量上传：不允许； 访问速度：网站速度快，图片加载速度快。 9. 随意贴 容量流量：免费注册1GB空间，20GB流量； 图片尺寸：原图； 保存时间：永久； 批量上传：允许； 访问速度：网站速度快，图片加载速度快。 10. Lofter网易旗下轻博客。可以通过网易相册上传。 容量流量：无限； 图片尺寸：默认缩略图与原图； 保存时间：永久； 批量上传：允许； 访问速度：网站速度快，图片加载速度快。 11. 网易相册网易旗下网站。 容量流量：免费1GB容量，达到上限每月还可上传300M； 图片尺寸：默认缩略图与原图； 保存时间：永久； 批量上传：允许； 访问速度：网站速度快，图片加载速度快。 12. Gimhoy图床看链接是基于新浪云服务的，不清楚是不是把微博相册商业化了。 容量流量：无限空间，无限流量； 图片尺寸：原图； 保存时间：永久； 批量上传：允许，可以远程上传（Url）； 访问速度：网站速度快，图片加载速度快。 以上图床注册账号后都可以管理自己上传的图片。另外还有其他如七牛、亚马逊及阿里等互联网公司都提供付费云储存空间，可以免费试用，但是注册需要实名制，我就不一一尝试了，各位有兴趣可以去了解一下。 我常用的是 Tinypic 和微博相册，两者上传和加载速度都很快。如果数据很重要，建议大家使用大厂家的付费存储服务。上传到 Tinypic 的图片可以利用 ShareX，上面提到的 Photobucket，ImageShack 以及 SomeImage 等诸多主流网站都可以使用该软件进行便捷的截图、上传文件、链接复制等操作，其他的可以通过自定义来设定。首先要设置上传目的地，登录不同网站的账号或者API，然后就可以通过截图、粘贴板或者浏览文件上传文件到目的网站。基本使用方法就是这样，下载了摸索一会就能上手。若有不懂的可以留言（复杂的我也不懂(ㄒoㄒ)）。","categories":[],"tags":[{"name":"Soft","slug":"Soft","permalink":"http://yoursite.com/tags/Soft/"},{"name":"Write","slug":"Write","permalink":"http://yoursite.com/tags/Write/"}]},{"title":"信息繁杂，还需分而化之","slug":"信息繁杂，还需分而化之","date":"2016-09-28T10:32:00.000Z","updated":"2017-09-02T17:47:35.514Z","comments":true,"path":"2016/09/28/信息繁杂，还需分而化之/","link":"","permalink":"http://yoursite.com/2016/09/28/信息繁杂，还需分而化之/","excerpt":"","text":"如今大部分人几乎脱离纸和笔，收集、记录信息都已数字化。同时，这个时代的信息量又是如此巨大，倘佯在信息之海，各种信息若只是借助单一的应用小船拖载，不仅杂乱、低效，更重要的是若小船翻了，上面的信息也会湮灭。所以我们不仅要学会将繁杂的信息分类记录，我们还要对自己的信息数据安全负责。 如何保证信息的记录易整理且数据安全？不少读者可能烦恼过这个问题。“不要将鸡蛋放在一个篮子里”，分而化之，这是最简单也是最安全的信息管理模式。我结合自身分化解决信息问题的经验给大家一些建议，其中会牵涉到比较多的软件，我会简单介绍各软件在我的信息系统中的作用，并会推荐类似应用给大家提供更多选择，希望大家会有耐心浏览到最后。 声明：除了 Workflowy 邀请链接 和幕布邀请链接 外，以下软件和链接无任何利益相关，评测我会尽量选择 ifanr 的文章。 一、信息收集网络世界里信息丰富，也是我们主要的信息来源。我们浏览过的信息不可能全部用大脑记忆，快捷有效地采集这些信息是提高信息消化效率的主要途经。 曾写过一篇专门介绍网络信息收集应用的小文章，点击阅读。 这类的应用主要分两类，共有如图四个。 1. PocketPocket 无论是移动版还是网页版，对网页再排版效果都特别好，有 Chrome 一键保存扩展及离线阅读应用，配合移动端应用，使用很方便。我用来保存有深度的人文类、生活类文章，包括短篇小说、散文、哲学、科学等等。 ifanr 评测文章：稍候阅读随身行 – Pocket 中文版。 2. DiigoDiigo 的 Chrome 插件 Diigo Web Collector 不仅可以收藏网页，还有高亮网页文字，添加笔记和截屏保存等功能。结合 Diigo 笔记工具 Quick Note(需到 Chrome 应用商店下载) 和移动端应用可以轻松管理。这款软件因为可以添加注记，我用来保存学习和工作的文章，重点部分轻松保存。 Chrome插件网测评：Chrome书签、注释、截图、标记插件：Diigo Web Collector。 3. Raindrop.io在 Instapaper 和 Readerbality (已经停止服务) 停滞不前时，只有 Raindrop.io 还在继续开发以抗衡 Pocket 的不断壮大。其 Chrome 插件有侧边操作栏，不用登录网页可以就可以管理收藏列表和进行设置操作，也提供了移动端应用。这样就比较适合我这种喜欢折腾软件的人，用来保存教程类的文章再方便不过了。不过这个软件有时候保存的速度稍慢，也不能单独收集文字或者图片，只能收集整个网页。 ifanr 评测：你要的完美云书签，可能就是它 – Raindrop.io 。 4. 花瓣花瓣网提供浏览器插件，能够在网页批量、截图采集图片到花瓣网，是公开的。另外还有书签栏采集工具，以供不能使用插件的浏览器使用。花瓣移动端应用也是在停更几年后重新启动。这个我主要用来收集图片。 同类应用推荐 方片收集 全能便捷的收集应用，之前很喜欢用这个，但是后来有一次登陆的帐号竟然被替换了(官方给的解释是程序员后台操作时不小心把自己的帐号全局了)，就抛弃了。确实好用。 收趣 只能在移动端阅读收藏的文章。 Candy 和 Rraindrop.io 类似，无移动端应用 iOS 端已发布测试版， Android 后续会发布。 二、信息编写生活中的个人信息、想法的记录，是自己最重要的隐私，这会关系到财产安全甚至人身安全，这类应用选择要慎重，主要以安全易用的为主。 1. 临时信息临时信息顾名思义就是没有个人信息，不需要长久保存，只是短时间需要使用，比如某个陌生人联系方式、约会地点、购物清单等。这类选择就比较轻松，因为无重要个人信息，且可不用联网，那么个人信息就不容易被他人获取。 (1) 随笔记随笔记(GNotes 的中国大陆版)，很轻量的笔记应用，选择这个主要是考虑到临时的信息很杂，各种内容都有。该软件移动端使用方便，清单、提醒、照片、录音、手指画和附件都可以加入笔记，可以同步到帐号或者Gmail，访问Web也可以浏览笔记，Chrome 有记录笔记插件。超过一定字数后会卡顿。 (2) 文本编辑器这个在桌面使用，新建一个临时信息.txt 文件放在桌面，需要记录时直接打开写入，整理也很方便。 同类应用推荐 ColorNote 制作待办事项和购物清单，可以使用密码来保护便签， 支持备份到SD卡， 支持在Google号备份和同步。 Parchi 微软出品，不能同步。 Zoho notebook 出自”全球第一大在线软件提供商”Zoho，功能全面，界面美观，手势操作很华丽便捷。 舒心录 个人产品，支持Markdown语法、单条加密和本地及网盘备份。 CatMemoNote PC桌面上简洁好用的记事软件，是日本人作品，个人汉化，类似的还有很多，Minipad2，Treepad，Mempad等，可以看看相关推荐 ，不过其中部分停止更新了，需要的可以自己搜索下载。 2. 非临时信息这类笔记比较重要，需要长期保存，有比较重要的隐私，比如不常用易忘的帐号、注册信息、纪念日、地址等。 (1) SimplenoteSimplenote 是与博客平台 Wordpress 同厂出品，只能记录纯文本，支持 Markdown 语法，各种平台都支持，真正的全平台，同步速度也相当快，几乎是瞬时。除了记录信息外，平常手机上的写作我也在这里进行。桌面端比较重，可以考虑第三方应用 Notation，同样可以双向即时同步。 异次元评测:Simplenote - 简约极致、轻量高效的云同步纯文本笔记软件 (支持 Markdown 写作)。 (2) Workflowy(邀请链接)Workflowy 是一款简洁而不简单的纯文本记录应用，每条 Iterm 可无限制向下建立分支，用来记录头脑风暴相当合适，还可以用作 Todo 来管理未完成工作，也可以用来编写提纲。通过 # 和 @ 建立标签轻松分类管理全局 Iterms，支持团队协作。Chrome 离线应用、Web 版和移动端都非常容易上手。这款优秀的应用我是用来写工作日志和文章提纲，结合幕布可以制作思维导图，利用 Chrome 插件 Workflowy for coder 可以支持 Markdown ，结合 Stylish 还可以可插入图片，移动端结合 Orgzly 可以设置提醒。 ifanr 评测：WorkFlowy：整理你的思绪知乎使用经验：如何玩转 WorkFlowy？ (3) OneNote这个是我整个笔记系统里面唯一的重量级应用，因为有些东西必须要用到大厂商相对可靠、安全的服务，比如说敏感个人信息、日记、重要超长篇笔记，并且可以配合 Office 和 Onedrive 使用，用来知识整理还是比较方便。这个应用在手机上可能比较慢，我一般用随笔记编写，然后利用分享功能保存到这里，既避免使用臃肿的软件本体，又能安全保存数据。 ifanr 使用经验： OneNote 深度教学：这 17 个功能你必须知道。 同类应用推荐 幕布 基本功能与 Workflowy 相似，可以生成简单的思维导图，该文章内的树状图都是在这里生成。 Dynalist 等 Chrome 和 Android 应用出来了就换这个。“我们最初想做 Dynalist 就是因为 WorkFlowy 不能满足我们的需要……现在 WorkFlowy 有的基本都有了”该网站Dynalist 的创始人之一如是说——来自知乎Dynalist 与 WorkFlowy 主要的区别，或者说改进在什么地方？的回答。 Evernote 国内版是大家熟悉的“印象笔记”，全能型，第三方软件也很多，如果不喜欢大部头可以使用轻量级的移动客户端 Evermemo 或者 Purenote，在特定的文件内记录笔记可以双向同步。 3. 非常重要的隐私Box对于正值青春年少的我们，浏览网页时可能会有一些特别的东西需要保存，比如下载链接、图片，或者不愿意被人看到，或者根本就不能被任何人看到。这部分内容我就用了国内比较小众的 Box 网盘，结合 ShareX 桌面应用和 Chrome 插件可以将图片或者文字一步上传到 Box，移动端可以用 Box 官方应用，也可以用 ES 文件浏览器也可以上传和浏览盘内文件。 同类应用推荐 Yandex 网盘 俄罗斯著名搜索引擎出品，传输速度没有 Box 快。 Drobox 网盘 对，我们这部分就是要选择小众的，比较难用的，才能杜绝别人来偷窥隐私。 三、信息发布信息的发布对于我们普通人就是写博客或者微博了。 1. Farbox博客我选择了 Farbox，因为浏览量比较少，买了30元五年的服务，每个月100M，比 Wordpress 之类需要搭建网站的更简单上手。配套有编辑器 FarBox Editor，支持 Markdown 写作，登陆账号后写的文章自动发布到博客。可以同步到 Drobox。 Farbox 可以不用图床直接插入图片，但是博客内容加载比我用的图床 Tinypic 慢，Tinypic 也可以结合 ShareX 使用，截图、图片上传和外链复制都很方便。 36Kr评测：[博客还有另外一种极简的可能性，叫 FarBox。] (http://36kr.com/p/217779.html) 同类应用推荐 简书 比较年轻化的一个写作与阅读社区，网页 Markdown 支持相当好，写作与阅读体验都很棒。 Wordpress 著名博客平台，要自己研究折腾，模板比 Farbox 多。 2. 微博这个大家都会使用，就不多说了。选择用来发布个人心情，有趣、有益、简单的事情。 四、总结上面总结起来就如下图所示： 虽然上面一套看起来很繁琐，大家可以参考精简，不必用这么多软件，但是尽量分开为好，因为若某个网站收集太多个人信息，甚至可以还原建立一个三维的个体，比我们自己还要了解自己，这方面多花一些心思还是值得的。","categories":[],"tags":[{"name":"Soft","slug":"Soft","permalink":"http://yoursite.com/tags/Soft/"},{"name":"Note","slug":"Note","permalink":"http://yoursite.com/tags/Note/"}]},{"title":"10款高效网页收集应用","slug":"10款高效网页收集应用","date":"2016-09-09T03:14:00.000Z","updated":"2017-09-02T17:54:51.186Z","comments":true,"path":"2016/09/09/10款高效网页收集应用/","link":"","permalink":"http://yoursite.com/2016/09/09/10款高效网页收集应用/","excerpt":"","text":"浏览美图多、文章优美的网页需要时不时收集素材和记录灵感，使用优秀的浏览器或者移动端收集工具能够让你事半功倍。下面简单介绍几款优秀的收集工具。 1. 工具(1) 方片收集方片收集是近期发行的“OK记”升级产品，有比较新颖的“拖拽”收集方式，还有更多便捷流畅的多样化收集方式可以收集网页上的任何内容，还能新建笔记以及编辑收集的内容，完全免费。方片收集覆盖了浏览器、iSO、Android，支持同步，可以算是狭义的全平台支持了，浏览器点击下载，移动端扫描二维码下载。详细介绍请看另一篇文章《方片之间，包容万象——方片收集》。 (2) DragdisDragdis是另一款拖拽收集应用，现在只有Chrome扩展(之前有Firefox和Safari，精简业务都去掉了)。可以保存文字、图片、连接和视频，初始只提供五个文件夹分类，邀请一个好友增加一个，付费后无限制。这个限制其实有点鸡肋，分类而已，五个就足矣。收集的内容需要在网内浏览。 (3) Candy这个收集一个网页称之为”a Candy”，多个“Candy”组成一条“Stroyline”。免费用户只提供一条“Stroyline”。提供站内的网页再排版服务，但不能显示图片。只支持Chrome。 (4) QQ收藏QQ收藏在QQPC和移动客户端都是常用功能，浏览器插件，可以收藏链接、文字、图片，一部分文章能重排提供阅读模式，但是需要登录桌面QQ客户端才能使用，现在已知的是“知乎”页面不能收藏。 (5) Pocket这是鼎鼎大名的稍后读应用，现在可以说在市场独占鳌头，功能也比较齐全，全平台同步，在国内也能有很快的速度。网页充排版相当出色，部分网站如新浪博客排版后不显示图片。Chrome有收集扩展和应用，可以离线浏览内容。 (6) Instapaper另一个稍后读巨头，与Pocket功能类似，但是网页抓取没有Pocket好，中文有时候乱码，文章末尾的推荐以及二维码之类的干扰信息不会被去除。Chrome只有收藏按钮，通过网页或者App可以阅读、管理。整个服务还支持发送到kindle或者保存为epub格式。现在已经被Pinterest收购，但会继续提供服务。 (7) Readability稍后读应用。可以重排网页提供阅读模式，中文有时候乱码，网站速度、同步速度欠佳，可以同步到kindle，不过月底就要停止服务了，现在提供数据导出。 The Readability bookmarking service will be shutting down on September 30, 2016.CBDPCBDPYou can export your bookmarked articles by visiting your Tools page. Thank you for your support in this amazing experiment. (8) Raindrop.io全能稍后读应用，收集、网页打开速度都比较慢，PC上网页只能保存链接不提供站内阅读，手机端提供再排版，并且新浪博客显示图片。能智能识别重复收藏链接。 (9) 收趣国产稍后读应用，收集内容只能在移动端查看，中文网页再排版效果尤佳，比Pocket要出色，但是有些网页不能重新排版，，可以同步到kindle，还可以导入Pocket内容，如果后期功能能完善，在国内应该可以取代Pocket。 ###(10) 花瓣这个是专业图片收集网站，大家应该很熟悉。花瓣网提供的浏览器插件，能够在网页采集图片到花瓣网，可以单个采集(点击图片上的“采集”浮动按钮)，也可以批量采集(点击插件Logo进行采集)，另外还有书签栏javascript，以供不能使用插件的浏览器使用。 2. 对比分析(1) 网页重排 Web 从左至右分别是Readerbality，Instapaper，Pocket。 移动端(夜间模式) 从左至右分别是Instapaper，Readability，Pocket，Raindrop.io，收趣。 (2) 功能 项目 侧边栏 FunP Dragdis Candy 无 无 容量 无限制 免费至多20个分类文件夹 免费一个集合Storyline 无限制 无限制 分类 标签 文件夹 Storylines 标签+自动识别 标签 对象 文字、图片、链接、视频 文字、图片、链接、视频 链接、文字 文字、图片、链接、视频 网页内文章 操作 拖拽+按钮+右键+编辑 拖拽 右键+按钮 右键+按钮 右键+按钮 网页重排 无 无 有 有 有 速度 收集快/浏览同步块 收集快/浏览慢 收集慢/浏览快 收集较快/浏览较快 收集快/浏览同步块 同步 PC、移动互相同步 只支持Chrome 只支持Chrome 全平台同步 PC收集可同步大移动端 团队协作 目前无 支持 支持 无 无","categories":[],"tags":[{"name":"Soft","slug":"Soft","permalink":"http://yoursite.com/tags/Soft/"},{"name":"Note","slug":"Note","permalink":"http://yoursite.com/tags/Note/"}]},{"title":"方片之间，包容万象——方片收集","slug":"方片之间，包容万象——方片收集","date":"2016-09-07T07:19:00.000Z","updated":"2017-09-02T17:47:43.464Z","comments":true,"path":"2016/09/07/方片之间，包容万象——方片收集/","link":"","permalink":"http://yoursite.com/2016/09/07/方片之间，包容万象——方片收集/","excerpt":"","text":"浏览网页时，大概都会遇到以下三种情况： 广告、社交、二维码之类的无关信息太多，影响阅读体验； 文章篇幅较大，当下没有足够时间阅读，想保存抽空再阅读； 网页中有部分信息比较有用，希望保存下来以后能够找到。 针对上述情况，运用网页收集应用就可以方便省心了，这类应用主流的有Pocket、印象笔记、有道云笔记等，还有今天要介绍的新星——方片收集(点击有惊喜)。 方片收集就是之前的“OK记”(OK记 品牌升级公告)，升级之前我就曾就接触过，觉得拖拽收集好用还好酷，但当时只有Chrome版本，我一直在等待Android版，然后就等来了这个焕然一新的产品，并且还自带属性光环： A. 2016年7月18日，第二届“中国创翼”青年创新创业大赛长沙赛区举行颁奖礼，方片收集荣获二等奖；B. 2015年10月13日，OK记团队在阿里云“诸神之战”创客比赛全国中夺得全国总冠军。 在为Pocket等这些大作惊叹之后，能够看到国人开发、使用更加便捷实用的作品，从心理角度来说感觉还是蛮好的，不过在体验之后你会觉得从“生理”角度来说也是相当不错的，因为它帮你节省了点鼠标、划屏幕的体力操作。 由于是刚品牌升级不久的产品，还没有比较详细的测评，我就我自己使用几天后的“经验”写一点。 方片收集覆盖了浏览器、iSO、Android，可以算是狭义的全平台支持了，点击下载，或者扫描二维码下载。 1. 官方网站就我个人而言，寻找服务时我会找官方网站，拨打其提供的电话，下载其提供的软件，这也是从一个方面降低被诈骗的几率。如果看到的官网都跟盗版网站一样，那我觉得这个产品或者服务肯定还不成熟。 官网首页 方片的官网看到之后就不会有这个顾虑——浩渺的宇宙、深邃的星空的背景，简约的页面布局，有较强视觉冲击。官网里面提供了各平台的软件下载，附有简单视频介绍使用方法，并有详细的帮助说明，如果没看也没关系，软件里也会有相应的说明。 A. 官方简单介绍视频B. 官方详尽帮助说明 2. PC端方片收集PC端主要以浏览器为主要阵地，目前支持 Chrome、Firefox 和国内主流 Chromium 系列浏览器(Safari暂不知晓，没有设备，官网安装插件也是自动识别，没有明确写明)。 (1) 便捷收集方式方片收集的最大亮点就是简单的拖拽收集。安装浏览器扩展程序后，在左侧会有一个可以隐藏的侧边栏，点击浏览器左上角的“→”图标，或者使用快捷键Alt+1可唤出，或者在拖拽所要收集的文字、图片时，该栏也会显示，再将文字、图片放入即可。页面网址和页面内链接(这里说网址和链接是为了区分已加载页面和该页面内包含的网址信息，下同。)都可以拖拽保存，视频直接点击浮动的方片按钮即可。 拖拽收集 视频收集方式 就这么简单，按照当时创始人的说法就是： “印象笔记、有道笔记、Pinterest要五六步操作才完成的事，OK记只要简单的一步操作就可以完成”。 (2) 其它收集方式对于文字的收集，除了拖拽之外还有便捷按钮可以使用。在选中文字之后，会出现两个浮动按钮，如下图所示：一个二维码生成按钮(二维码大家都知道怎么用)，一个摘录按钮。前者在生成二维码的同时，也会将文字保存，设计者这个细节考虑的还是比较周到，后者则直接保存文字。这两个按钮可以设置为不显示。图片、网址可以右键保存，网址还可以在浏览器扩展栏点击方片的图标存入。多种方式可供选择，不会僵化使用者的思维、操作习惯。 文字共享及收集方式 (3) 手动新建贴纸方片侧栏还有一个“新建贴纸”的按钮，可以手动添加不是来自于网页内容的贴纸，相于是一个简单的记事本功能。 (4) 分类功能方片的收集栏采用的是卡片风格，每收集一项内容称之为一个“贴纸”，每个“贴纸”可以添加标签以分类。在使用拖拽收集的时候，可以将项目拖到相应的标签，那这个项目就直接给打上该标签了。点击搜索框展开分类列表标签可以新建、编辑及删除标签。在新建标签的时候，前面不需要添加“#”，方片会自动添加，否则会提示错误。 (5) 搜索功能支持标签和全文搜索，可以快速找到过去过保存的灵感或重要图片、文字。 (6) 编辑功能在将网页内容保存到方片里后，有可能还想要添加一下个人观点，方片就提供了修改功能。在该卡片菜单中选择编辑或点击卡片右下角“展开编辑”按钮进入编辑页面后，将光标放在文本处就可以看到方片提供了一些简单的富文本编辑选项，暂时还没有图片修改功能。 编辑功能 “贴纸”的编辑还可以合并多个贴纸，打开一个“贴纸”后，从侧边栏将其它贴纸拖入即可，注意一定要用鼠标按住“贴纸”的上边框再拖，点在内容上是无法拖拽的。直接拖入是合并两个“贴纸”，按着Alt再拖入可以保留该“贴纸”。 合并功能特别适用于碎片信息的收集与整理，这也是方片轻量化，与印象、有道等重量级的产品理念主要区别——简单操作，随心而为。 合并“贴纸”(下图中发现了一个小小的错误) (7) 社交功能在收集“贴纸”的时候，有“私密”和“公开”之分。 “私密贴纸不会被允许分享，如若需要分享，您需要设置当前贴纸为非私密，即可分享。将来我们的产品会设个人主页，您私密的贴纸就不会在个人主页上被公开。” 新收集的“贴纸”会被默认为公开，但是自己手动新建的“贴纸”是默认的私密，这些细节开发者也是充分考虑过的，足见该团队用心之细。新收集的“贴纸”只需在该贴纸菜单中勾选“私密”选项即可。 其实我个人认为新收集的“贴纸”也应该是私密的，如果用户希望分享再设置为公开就好了，毕竟从用户心理焦炉来说还是希望有更多的私密性的。不过根据官方的设计和发展理念，这种设计也不难理解。 “方片收集”鼓励知识的收集与分享，也希望将您的见闻分享给大家。 3、移动端 我没有设备只能体验一下Android端，iOS端就引用一下官方 的吧(づ╥﹏╥)づ。 Andriod端有两个客户端：一个是“方片收集”，另一个是“方片记事”。官方给出的Apk下载连接是“应用宝”的，下载数据好像不容乐观…… “方片收集”和“方片记事”Andriod端 “方片记事”是“方片收集”的轻化版(其实从安装包大小来看只有1M的差别)。这可能是两个功能的不同发展方向，一个走记事本的路线，一个走收集工具的路线，给那些用了其它收集工具，想使用方片产品但又不想装有同样功能软件的人一个更多的选择。因为“方片收集”包含且多于“方片记事”的功能，所以下面只介绍前者。 (1) 笔记功能方片收集移动端延续了简约黑白红高对比度的三色设计，UI精简美观，只有设菜单、新建笔记和粘贴板三个按钮，最大化可视区域。 菜单。和其他软件一样提供常规的登陆、软件设置等操作，不必细说； 新建笔记按钮。安装软件初次打开会提示申请摄像头使用权，选择同意才能愉快地使用。 单击按钮，新建笔记，笔记内可以插入二维码/条码信息、照片、录音，和PC一样默认为私密“贴纸”。这里可以看到，细心设计者将二维码/条码信息的记录都考虑进来了，省去了复制和粘贴的繁琐操作。 长按按钮，快捷新建录音笔记。录音笔记不仅有录音文件，还有方片自动翻译的对应文字。 (2)收集功能移动端的收集主要是靠粘贴板和各应用自带的分享功能。 利用粘贴板收集。 这种收集方式需要保证程序在后台运行，并要选择对象然后复制。官方给的说明里面是复制后就直接收集了，但是我这里不是这样的，还需在上面说过的粘贴板里面进行操作——左滑存入为当前分类，右滑存为私密分类。 利用其他应用分享功能收集。这与微信分享朋友圈类似，不必赘述。 利用微信公众号收集。这种方法需要关注公众号“方片收集”，将文章，网址，图片发给Ta，就可以收集保存在云端。 (3) 分类功能在非编辑界面，贴左边右滑唤出标签拦，可以设置当前分类，继续右滑可以新建和编辑标签。回收站也可以看做是一个标签，在这里可进行恢复误内容，清空回收站的操作。 (4) 搜索与编辑功能与PC上一样，收集的“贴纸”可以被搜索和编辑。列表模式每个“贴纸”右上角“菜单”可以进入编辑，阅读模式下左下角的“菜单”也可以进行编辑。最新编辑过或新增的“贴纸”会被置顶。 (5) 同步功能注册方片收集帐号，可以在PC和移动端同步，并且同步速度相当快，在任何一边添加新的内容另外一边马上就可以刷新出来，这就是服务器在国内的好处。服务器内备份保证更换设备后数据不会丢失，另外我在文章开头说了一大堆该应用的背景，就是想告知那些担心数据安全的用户，这个团队投资是充足的，若真有尽头时，以这个团队“心有猛虎，细嗅蔷薇”的作风，肯定会给用户一个良好的解决方案。 (6) 后续开发功能 A. 简历用户个人主页，提供知识分享平台(可能类似“方片官方个人主页”)；B. 印象笔记／Evernote／有道云笔记／Onenote等其他笔记工具的导入与同步功能。 #4 iOS端看官方的说明，iOS除了在复制收集这点上与Android有不同外，其它基本一致，下面引用官方说明中的相应部分。 (1) 配置通知栏； A. 顶部下拉唤出「通知栏」；B. 在「今天」面板底部选择「编辑」；C. 点击「方片已收集」左边「绿色加号」；D. 记得最后点击右上角「完成」即可配置完成。 (2) 复制想要收集的内容；(3) 下拉通知栏，“今天”中的方片会自动帮你收集。 iOS复制收集操作 #5 对比分析与其它收集工具相比较，方片收集又有怎样的优势与不足呢？我在每个领域(其实功能也相差不多少)挑一个比较好的来对比分析一下，供大家参考。 (1) DragdisDragdis是另一款拖拽收集应用，现在只有Chrome扩展(之前有Firefox和Safari，精简业务都去掉了)。初始只提供五个文件夹分类，邀请一个好友增加一个，付费后无限制。这个限制其实有点鸡肋，分类而已，五个就足矣。收集的内容需要在网内浏览。 (2) Candy严格来说这个只是单纯的书签保存应用，我们从某个方面来对比借鉴一下。这个收集一个网页称之为”a Candy”，多个“Candy”组成一条“Stroyline”。免费用户只提供一条“Stroyline”。提供网页再排版服务，但不能显示图片。只支持Chrome。 (3) Pocket这是鼎鼎大名的稍后读应用，现在可以说在市场独占鳌头，功能也比较齐全，全平台同步。网页充排版相当出色，在国内严酷的网络环境下也能有很快的速度。Chrome有收集扩展和离线应用，可以方便浏览内容。 对比分析 项目 侧边栏 FunP Dragdis Candy 无 限制 无 免费至多20个分类文件夹 免费一个集合Storyline 分类 标签 文件夹 Storylines 标签+自动识别 对象 文字、图片、链接、视频 文字、图片、链接、视频 链接、文字 文字、图片、链接、视频 操作 拖拽+按钮+右键+编辑 拖拽 右键+按钮 右键+按钮 网页重排 无 无 有 有 速度 收集快/浏览同步块 收集快/浏览慢 收集慢/浏览快 收集较快/浏览较快 同步 PC、移动互相同步 只支持Chrome 只支持Chrome 全平台同步 团队协作 目前无 支持 支持 无 也不说哪个好哪个不好，各位见仁见智。 6 建议 (1) 因为方片收集是侧边栏管理，可是空间相对较小，重复收集的几率很大，所以希望那个能有连接重复提示(图片、视频也需要从链接上来分析是否重复)，文字则不需要。如果这个会影响收集速度，那可以在操作栏添后者移动短加重复项目的分析功能； (2) 支持IFTTT，这个好像需要强大的后台计算能力，国内应用好像除了新浪围脖外没有支持的，困难那就可以不必考虑； (3) 不要过度追求产品的全能，做大作死的产品多见不鲜，这点上Dragdis更是直接只专注与Chrome省的发展，虽然这极大可能是由于资金不足，但也是明智的发展策略。不管方片以后走怎样的路，要精而不要全。个人从功能、发展上想到的建议就只有这些了，本来想说提供网页离线浏览的，但是好像不符合第三条建议，作罢。各位如果有好的想法可以给客服提议。 #7 团队TEAM最后来看一下方片背后的 QuickWis团队，从官网来看这是2015年时候的情况，现在具体情况没有查询到，可能有更多人加入了这个团队。 Logo 工作单人照 生活全体照(那个歪果仁呢？) 仔细看会发现里面竟然有韩寒——“书曾过眼平心看，道不依形触目存”，哈哈。希望各位用过就会喜欢。 ##PS. A. 工作最近比较闲，花了大量时间研究博客平台，最后购买了Farbox的基础服务，再选择图床(我不知道图片的流量算不算Farbox流量，反正为了节省流量我都没有选择官方提供的大量优美的Gif素材)，又花了两天时间写这个博客，虽然累但是看到有点小成果出来还是比较开心，顺便还能跟大家分享一下这两个优秀的国产软件，不管有没有读者我都会继续写点东西。B. 该文章同步发布在简书个人主页YiCH，感谢支持。","categories":[],"tags":[{"name":"Soft","slug":"Soft","permalink":"http://yoursite.com/tags/Soft/"},{"name":"Note","slug":"Note","permalink":"http://yoursite.com/tags/Note/"}]}]}